
import re  # 导入Python的re模块
area={"11":"北京","12":"天津","13":"河北","14":"山西","15":"内蒙古","21":"辽宁","22":"吉林","23":"黑龙江","31":"上海","32":"江苏","33":"浙江",
        "34":"安徽","35":"福建","36":"江西","37":"山东","41":"河南","42":"湖北","43":"湖南","44":"广东","45":"广西","46":"海南","50":"重庆",
        "51":"四川","52":"贵州","53":"云南","54":"西藏","61":"陕西","62":"甘肃","63":"青海","64":"宁夏","65":"新疆","71":"台湾","81":"香港",
        "82":"澳门","91":"国外"}
######################################################################################
def check(idcard):
    idcard=idcard.strip()

    if(len(idcard)!=18)
        print('身份证号码位数不对！')
        return 0
    if(idcard[0:2] not in area):
        print('身份证号码校验错误！')
        return 0
    if(int(idcard[6:10]))% 4== 0 or (int(idcard[6:10]) % 100 == 0) and int(idcard[6:10])%4 == 0 )):
      ereg=r'[1-9][0-9]{5}19[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|[1-2][0-9]))[0-9]{3}[0-9Xx]$'#//闰年出生日期的合法性正则表达式

    else:
      ereg=r'[1-9][0-9]{5}19[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|3[0-1])|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|1[0-9]|2[0-8]))[0-9]{3}[0-9Xx]$'#//平年出生日期的合法性正则表达式

    if(re.match(ereg,idcard)):  


########################################################################################
#定义函数panduan(ID)
import re
def panduan(ID):

   
   
    
                        
    #ID_add=ID[0:6]     13108219990204077X
    #year=ID[6:10]
    #month=ID[10:12]
    #day=ID[12:14]
    #ID_sex=ID[14:17]

    add=re.findall('\d{2}',ID)
    for i in range(len(ar)/2):
        if add in ar[i][0:2]:
            print("此人是"+ar[i+1]+'人')
        
   #year=re.findall('',ID) 
    
    

    print("生日："+year+'年'+month+'月'+day+'日')
    if int(ID_sex)%2==0:
        print("性别：女")
    else:
        print("性别：男")

################################################################################################################
            
ID=input('请输入十八位身份证号码: ')
if check(ID):
    panduan(ID)   #此处调用函数  panduan(ID)#
